{"identifiers_to_tokens": {"padding_token": null, "bos_token": null, "eos_token": null}, "idx_to_token": ["B-aircraft_code", "B-airline_code", "B-airline_name", "B-airport_code", "B-airport_name", "B-arrive_date.date_relative", "B-arrive_date.day_name", "B-arrive_date.day_number", "B-arrive_date.month_name", "B-arrive_date.today_relative", "B-arrive_time.end_time", "B-arrive_time.period_mod", "B-arrive_time.period_of_day", "B-arrive_time.start_time", "B-arrive_time.time", "B-arrive_time.time_relative", "B-booking_class", "B-city_name", "B-class_type", "B-compartment", "B-connect", "B-cost_relative", "B-day_name", "B-day_number", "B-days_code", "B-depart_date.date_relative", "B-depart_date.day_name", "B-depart_date.day_number", "B-depart_date.month_name", "B-depart_date.today_relative", "B-depart_date.year", "B-depart_time.end_time", "B-depart_time.period_mod", "B-depart_time.period_of_day", "B-depart_time.start_time", "B-depart_time.time", "B-depart_time.time_relative", "B-economy", "B-fare_amount", "B-fare_basis_code", "B-flight", "B-flight_days", "B-flight_mod", "B-flight_number", "B-flight_stop", "B-flight_time", "B-fromloc.airport_code", "B-fromloc.airport_name", "B-fromloc.city_name", "B-fromloc.state_code", "B-fromloc.state_name", "B-meal", "B-meal_code", "B-meal_description", "B-mod", "B-month_name", "B-or", "B-period_of_day", "B-restriction_code", "B-return_date.date_relative", "B-return_date.day_name", "B-return_date.day_number", "B-return_date.month_name", "B-return_date.today_relative", "B-return_time.period_mod", "B-return_time.period_of_day", "B-round_trip", "B-state_code", "B-state_name", "B-stoploc.airport_code", "B-stoploc.airport_name", "B-stoploc.city_name", "B-stoploc.state_code", "B-time", "B-time_relative", "B-today_relative", "B-toloc.airport_code", "B-toloc.airport_name", "B-toloc.city_name", "B-toloc.country_name", "B-toloc.state_code", "B-toloc.state_name", "B-transport_type", "I-aircraft_code", "I-airline_code", "I-airline_name", "I-airport_code", "I-airport_name", "I-arrive_date.date_relative", "I-arrive_date.day_name", "I-arrive_date.day_number", "I-arrive_date.month_name", "I-arrive_time.end_time", "I-arrive_time.period_mod", "I-arrive_time.period_of_day", "I-arrive_time.start_time", "I-arrive_time.time", "I-arrive_time.time_relative", "I-city_name", "I-class_type", "I-compartment", "I-connect", "I-cost_relative", "I-days_code", "I-depart_date.date_relative", "I-depart_date.day_name", "I-depart_date.day_number", "I-depart_date.month_name", "I-depart_date.today_relative", "I-depart_date.year", "I-depart_time.end_time", "I-depart_time.period_mod", "I-depart_time.period_of_day", "I-depart_time.start_time", "I-depart_time.time", "I-depart_time.time_relative", "I-economy", "I-fare_amount", "I-fare_basis_code", "I-flight_days", "I-flight_mod", "I-flight_number", "I-flight_stop", "I-flight_time", "I-fromloc.airport_code", "I-fromloc.airport_name", "I-fromloc.city_name", "I-fromloc.state_code", "I-fromloc.state_name", "I-meal_code", "I-meal_description", "I-mod", "I-or", "I-period_of_day", "I-restriction_code", "I-return_date.date_relative", "I-return_date.day_number", "I-return_date.today_relative", "I-return_time.period_of_day", "I-round_trip", "I-state_name", "I-stoploc.city_name", "I-time", "I-time_relative", "I-today_relative", "I-toloc.airport_code", "I-toloc.airport_name", "I-toloc.city_name", "I-toloc.state_code", "I-toloc.state_name", "I-transport_type", "O"], "reserved_tokens": null, "token_to_idx": {"B-aircraft_code": 0, "B-airline_code": 1, "B-airline_name": 2, "B-airport_code": 3, "B-airport_name": 4, "B-arrive_date.date_relative": 5, "B-arrive_date.day_name": 6, "B-arrive_date.day_number": 7, "B-arrive_date.month_name": 8, "B-arrive_date.today_relative": 9, "B-arrive_time.end_time": 10, "B-arrive_time.period_mod": 11, "B-arrive_time.period_of_day": 12, "B-arrive_time.start_time": 13, "B-arrive_time.time": 14, "B-arrive_time.time_relative": 15, "B-booking_class": 16, "B-city_name": 17, "B-class_type": 18, "B-compartment": 19, "B-connect": 20, "B-cost_relative": 21, "B-day_name": 22, "B-day_number": 23, "B-days_code": 24, "B-depart_date.date_relative": 25, "B-depart_date.day_name": 26, "B-depart_date.day_number": 27, "B-depart_date.month_name": 28, "B-depart_date.today_relative": 29, "B-depart_date.year": 30, "B-depart_time.end_time": 31, "B-depart_time.period_mod": 32, "B-depart_time.period_of_day": 33, "B-depart_time.start_time": 34, "B-depart_time.time": 35, "B-depart_time.time_relative": 36, "B-economy": 37, "B-fare_amount": 38, "B-fare_basis_code": 39, "B-flight": 40, "B-flight_days": 41, "B-flight_mod": 42, "B-flight_number": 43, "B-flight_stop": 44, "B-flight_time": 45, "B-fromloc.airport_code": 46, "B-fromloc.airport_name": 47, "B-fromloc.city_name": 48, "B-fromloc.state_code": 49, "B-fromloc.state_name": 50, "B-meal": 51, "B-meal_code": 52, "B-meal_description": 53, "B-mod": 54, "B-month_name": 55, "B-or": 56, "B-period_of_day": 57, "B-restriction_code": 58, "B-return_date.date_relative": 59, "B-return_date.day_name": 60, "B-return_date.day_number": 61, "B-return_date.month_name": 62, "B-return_date.today_relative": 63, "B-return_time.period_mod": 64, "B-return_time.period_of_day": 65, "B-round_trip": 66, "B-state_code": 67, "B-state_name": 68, "B-stoploc.airport_code": 69, "B-stoploc.airport_name": 70, "B-stoploc.city_name": 71, "B-stoploc.state_code": 72, "B-time": 73, "B-time_relative": 74, "B-today_relative": 75, "B-toloc.airport_code": 76, "B-toloc.airport_name": 77, "B-toloc.city_name": 78, "B-toloc.country_name": 79, "B-toloc.state_code": 80, "B-toloc.state_name": 81, "B-transport_type": 82, "I-aircraft_code": 83, "I-airline_code": 84, "I-airline_name": 85, "I-airport_code": 86, "I-airport_name": 87, "I-arrive_date.date_relative": 88, "I-arrive_date.day_name": 89, "I-arrive_date.day_number": 90, "I-arrive_date.month_name": 91, "I-arrive_time.end_time": 92, "I-arrive_time.period_mod": 93, "I-arrive_time.period_of_day": 94, "I-arrive_time.start_time": 95, "I-arrive_time.time": 96, "I-arrive_time.time_relative": 97, "I-city_name": 98, "I-class_type": 99, "I-compartment": 100, "I-connect": 101, "I-cost_relative": 102, "I-days_code": 103, "I-depart_date.date_relative": 104, "I-depart_date.day_name": 105, "I-depart_date.day_number": 106, "I-depart_date.month_name": 107, "I-depart_date.today_relative": 108, "I-depart_date.year": 109, "I-depart_time.end_time": 110, "I-depart_time.period_mod": 111, "I-depart_time.period_of_day": 112, "I-depart_time.start_time": 113, "I-depart_time.time": 114, "I-depart_time.time_relative": 115, "I-economy": 116, "I-fare_amount": 117, "I-fare_basis_code": 118, "I-flight_days": 119, "I-flight_mod": 120, "I-flight_number": 121, "I-flight_stop": 122, "I-flight_time": 123, "I-fromloc.airport_code": 124, "I-fromloc.airport_name": 125, "I-fromloc.city_name": 126, "I-fromloc.state_code": 127, "I-fromloc.state_name": 128, "I-meal_code": 129, "I-meal_description": 130, "I-mod": 131, "I-or": 132, "I-period_of_day": 133, "I-restriction_code": 134, "I-return_date.date_relative": 135, "I-return_date.day_number": 136, "I-return_date.today_relative": 137, "I-return_time.period_of_day": 138, "I-round_trip": 139, "I-state_name": 140, "I-stoploc.city_name": 141, "I-time": 142, "I-time_relative": 143, "I-today_relative": 144, "I-toloc.airport_code": 145, "I-toloc.airport_name": 146, "I-toloc.city_name": 147, "I-toloc.state_code": 148, "I-toloc.state_name": 149, "I-transport_type": 150, "O": 151}, "unknown_token": null}